{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Задача A. Делители - количество пар"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Дано натуральное число $n\\leqslant 10^8$. Подсчитайте количество таких пар чисел $(a,b)$, что:\n",
    "- $a$ и $b$ - делители $n$\n",
    "- $a<b$\n",
    "- $a$ и $b$ - взаимно простые\n",
    "- $a\\cdot b\\leqslant n$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "По условию, числа $a$ и $b$ - это делители $n$, значит их надо найти"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "divs = []\n",
    "for i in range(1, int(n ** 0.5) + 1):\n",
    "    if n % i == 0:\n",
    "        divs.append(i)\n",
    "        divs.append(n // i)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Теперь отсортируем `divs`, чтобы выполнить условие, что $a<b$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "divs.sort()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "И дальше рассматриваем перебирать пары $(a, b)$\n",
    "\n",
    "Так как $j\\in \\{i+1,\\ \\text{len(divs)}\\}$, это гарантирует, что $a<b$\n",
    "\n",
    "Также, нужно будет проверить условие, что $a$ и $b$ взаимно простые (то есть `gcd(a,b)=1`) и $a\\cdot b\\leqslant n$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from math import gcd\n",
    "\n",
    "cnt = 0\n",
    "for i in range(len(divs)):\n",
    "    a = divs[i]\n",
    "    for j in range(i + 1, len(divs)):\n",
    "        b = divs[j]\n",
    "        if gcd(a, b) != 1:\n",
    "            continue\n",
    "        if a * b > n:\n",
    "            break\n",
    "        cnt += 1\n",
    "\n",
    "print(cnt)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Задача B. Полная гистограмма при сортировке"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Условие\n",
    "Дан массив целых чисел $a_1,a_2,\\ldots,a_N$, каждый элемент которого лежит в отрезке $[-100;100]$\n",
    "\n",
    "Требуется для каждого числа $x$ от $-100$ до $100$ посчитать, сколько раз значение $x$ встречается в массиве.\n",
    "\n",
    "## Формат ввода\n",
    "В первой строке задано одно целое число $N$ — количество элементов массива $(1\\leqslant N\\leqslant 10^6)$. Во второй строке заданы $N$ целых чисел $a_i$ $(-100\\leqslant a_i\\leqslant 100)$\n",
    "\n",
    "## Формат вывода\n",
    "Выведите $201$ число — для каждого $x$ от $-100$ до $100$ включительно количество вхождений этого значения в массиве.\n",
    "\n",
    "Числа необходимо выводить в одной строке, разделяя пробелами. Первое число должно соответствовать значению $x=−100$, второе — значению $x=−99$, и так далее, последнее ($201$-е) число — значению $x=100$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Заведем массив `a` из 201 элемента. Каждый элемент будет отвечать за определенное число на отрезке $[-100;100]$\n",
    "\n",
    "Тогда, `a[0]` отвечает за число $-100$, `a[1]` — за число $-99$ и т.д. Значит, `a[i + 100]` отвечает за число $i\\in[-100;100]$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "a = [0] * 201\n",
    "n = int(input())\n",
    "b = list(map(int, input().split()))\n",
    "\n",
    "for i in range(n):\n",
    "\ta[b[i] + 100] += 1\n",
    "\n",
    "print(*a)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Задача C. Полезные бактерии"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Условие\n",
    "Бактерии вида bacteria rucodi размножаются по следующим правилам:\n",
    "* Колонию можно облучать одним из трёх цветов. Для достижения эффекта требуется облучать колонию одним и тем же цветом в течение суток.\n",
    "* При облучении колонии серым цветом число бактерий за сутки увеличивается на одну.\n",
    "* При облучении колонии бурым цветом число бактерий за сутки увеличивается в 4 раза.\n",
    "* При облучении бактерии малиновым цветом число бактерий за сутки увеличивается в 5 раз.\n",
    "* Изначально в колонии была одна бактерия. Определить, через какое наименьшее количество суток колония будет состоять ровно из $N$ бактерий\n",
    "\n",
    "## Формат ввода\n",
    "Во входном файле написано целое число $N$ $(1\\leqslant N \\leqslant 10^6)$ — требуемое число бактерий.\n",
    "\n",
    "## Формат вывода\n",
    "В первой строке выходного файла выведите минимальное количество суток для достижения размера колонии $N$. Во второй строке выведите числа, задающие размер колонии каждые сутки. Первое число при этом должно быть равно $1$, а последнее $N$"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Почти обычная динамика (только надо еще и путь восстановить)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
